jhyang1203/STM32Braille/freertos.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : freertos.c
 * Description        : Code for freertos applications
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include "tim.h"
#include "Listener.h"
#include "Controller.h"
#include "Presenter.h"
#include "Model_Listener_Controller.h"
#include "nrf24l01p.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */

/* USER CODE END Variables */
osThreadId defaultTaskHandle;
osThreadId myListenerTaskHandle;
osThreadId myControllerTasHandle;
osThreadId myPresenterTaskHandle;

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */

/* USER CODE END FunctionPrototypes */

void StartDefaultTask(void const * argument);
void StartListenerTask(void const * argument);
void StartControllerTask(void const * argument);
void StartPresenterTask(void const * argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* GetIdleTaskMemory prototype (linked to static allocation support) */
void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize );

/* USER CODE BEGIN GET_IDLE_TASK_MEMORY */
static StaticTask_t xIdleTaskTCBBuffer;
static StackType_t xIdleStack[configMINIMAL_STACK_SIZE];

void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize )
{
	*ppxIdleTaskTCBBuffer = &xIdleTaskTCBBuffer;
	*ppxIdleTaskStackBuffer = &xIdleStack[0];
	*pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
	/* place for user code */
}
/* USER CODE END GET_IDLE_TASK_MEMORY */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
	/* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
	/* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
	/* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */

  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of myListenerTask */
  osThreadDef(myListenerTask, StartListenerTask, osPriorityNormal, 0, 128);
  myListenerTaskHandle = osThreadCreate(osThread(myListenerTask), NULL);

  /* definition and creation of myControllerTas */
  osThreadDef(myControllerTas, StartControllerTask, osPriorityRealtime, 0, 128);
  myControllerTasHandle = osThreadCreate(osThread(myControllerTas), NULL);

  /* definition and creation of myPresenterTask */
  osThreadDef(myPresenterTask, StartPresenterTask, osPriorityNormal, 0, 128);
  myPresenterTaskHandle = osThreadCreate(osThread(myPresenterTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
	Model_Listener_Controller_Init();
	nrf24l01p_rx_init(2500, _1Mbps);
	HAL_TIM_Base_Start_IT(&htim5);
	/* add threads, ... */
  /* USER CODE END RTOS_THREADS */

}

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN StartDefaultTask */
	/* Infinite loop */
	for(;;)
	{
		osDelay(1);
	}
  /* USER CODE END StartDefaultTask */
}

/* USER CODE BEGIN Header_StartListenerTask */
/**
 * @brief Function implementing the myListenerTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartListenerTask */
void StartListenerTask(void const * argument)
{
  /* USER CODE BEGIN StartListenerTask */
	Listener_Init();
	uint8_t rx_buf[NRF24L01P_PAYLOAD_LENGTH];
	char msg[64];
	/* Infinite loop */
	for(;;)
	{
		Listener_Execute();

		if (HAL_GPIO_ReadPin(NRF24L01P_IRQ_PIN_PORT, NRF24L01P_IRQ_PIN_NUMBER) == GPIO_PIN_RESET) {
			nrf24l01p_rx_receive(rx_buf);

			Motor_DisplayBits(rx_buf[0]);

			snprintf(msg, sizeof(msg), "rx data: 0x%02X \r\n", rx_buf[0]);

			HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), 10);

		}

		osDelay(1);
	}
  /* USER CODE END StartListenerTask */
}

/* USER CODE BEGIN Header_StartControllerTask */
/**
 * @brief Function implementing the myControllerTas thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartControllerTask */
void StartControllerTask(void const * argument)
{
  /* USER CODE BEGIN StartControllerTask */
	Controller_Init();
	/* Infinite loop */
	for(;;)
	{
		Controller_Execute();
		osDelay(1);
	}
  /* USER CODE END StartControllerTask */
}

/* USER CODE BEGIN Header_StartPresenterTask */
/**
 * @brief Function implementing the myPresenterTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartPresenterTask */
void StartPresenterTask(void const * argument)
{
  /* USER CODE BEGIN StartPresenterTask */
	Presenter_Init();
	/* Infinite loop */
	for(;;)
	{
		Presenter_Excute();
		osDelay(1);
	}
  /* USER CODE END StartPresenterTask */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

/* USER CODE END Application */
